Repository: katagaki/Random
Catalog: Intents/Localizable.xcstrings
Source language: en
Languages: ja

# Intent.GenerateNumber.Title
source: Generate Number in Range
ja: 範囲内の数字を生成

# Intent.GenerateNumber.Description
source: Generates a random number within the specified range.
ja: 指定された範囲内でランダムな数字を生成します。

# Intent.GenerateNumber.Minimum
source: Minimum
ja: 最小値

# Intent.GenerateNumber.Maximum
source: Maximum
ja: 最大値

# Intent.GenerateWord.Title
source: Generate Word
ja: 単語を生成

# Intent.GenerateWord.Description
source: Generates a random pronounceable word with the specified length.
ja: 指定された長さのランダムな発音可能な単語を生成します。

# Intent.GenerateWord.Length
source: Length
ja: 文字数

# Intent.LoremIpsum.Mode
source: Lorem Ipsum Mode
ja: Lorem Ipsumモード

# Intent.LoremIpsum.Mode.Words
source: Words
ja: 単語

# Intent.LoremIpsum.Mode.Sentences
source: Sentences
ja: 文

# Intent.LoremIpsum.Mode.Paragraphs
source: Paragraphs
ja: 段落

# Intent.GenerateLoremIpsum.Title
source: Generate Lorem Ipsum
ja: Lorem Ipsumを生成

# Intent.GenerateLoremIpsum.Description
source: Generates lorem ipsum placeholder text.
ja: Lorem Ipsumのプレースホルダーテキストを生成します。

# Intent.GenerateLoremIpsum.Mode
source: Mode
ja: モード

# Intent.GenerateLoremIpsum.Count
source: Count
ja: 数量

# Intent.GeneratePassword.Title
source: Generate Password
ja: パスワードを生成

# Intent.GeneratePassword.Description
source: Generates a random password with the specified options.
ja: 指定されたオプションでランダムなパスワードを生成します。

# Intent.GeneratePassword.MinLength
source: Minimum Length
ja: 最小文字数

# Intent.GeneratePassword.MaxLength
source: Maximum Length
ja: 最大文字数

# Intent.GeneratePassword.Uppercase
source: Include Uppercase
ja: 大文字を含む

# Intent.GeneratePassword.Lowercase
source: Include Lowercase
ja: 小文字を含む

# Intent.GeneratePassword.Numbers
source: Include Numbers
ja: 数字を含む

# Intent.GeneratePassword.Symbols
source: Include Symbols
ja: 記号を含む

# Intent.GenerateColor.Title
source: Generate Color
ja: 色を生成

# Intent.GenerateColor.Description
source: Generates a random RGB color and returns it as a hex code.
ja: ランダムなRGBカラーを生成し、16進数コードとして返します。

# Intent.GenerateCoordinates.Title
source: Generate Coordinates
ja: 座標を生成

# Intent.GenerateCoordinates.Description
source: Generates random geographic coordinates, biased toward land regions.
ja: 陸地に偏ったランダムな地理座標を生成します。

# Intent.SelectLetter.Title
source: Select Letter
ja: アルファベットを選択

# Intent.SelectLetter.Description
source: Selects a random letter from A to Z.
ja: AからZまでのランダムなアルファベットを選択します。

# Intent.SelectWord.Title
source: Select Word
ja: 単語を選択

# Intent.SelectWord.Description
source: Selects a random English word from the dictionary.
ja: 辞書からランダムな英単語を選択します。

# Intent.SelectEmoji.Title
source: Select Emoji
ja: 絵文字を選択

# Intent.SelectEmoji.Description
source: Selects a random emoji.
ja: ランダムな絵文字を選択します。

# Intent.SelectDate.Title
source: Select Date
ja: 日付を選択

# Intent.SelectDate.Description
source: Selects a random date within the specified range.
ja: 指定された範囲内でランダムな日付を選択します。

# Intent.SelectDate.StartDate
source: Start Date
ja: 開始日

# Intent.SelectDate.EndDate
source: End Date
ja: 終了日

# Intent.SelectTime.Title
source: Select Time
ja: 時刻を選択

# Intent.SelectTime.Description
source: Selects a random time of day.
ja: ランダムな時刻を選択します。

# Intent.SelectCountry.Title
source: Select Country
ja: 国を選択

# Intent.SelectCountry.Description
source: Selects a random country and returns its name.
ja: ランダムな国を選択し、その名前を返します。

# Intent.Error.InvalidRange
source: The maximum value must be greater than or equal to the minimum value.
ja: 最大値は最小値以上である必要があります。

# Intent.Error.NoCharacterSets
source: At least one character set must be enabled.
ja: 少なくとも1つの文字セットを有効にする必要があります。

# Intent.Error.WordlistUnavailable
source: The word list could not be loaded.
ja: 単語リストを読み込めませんでした。

# Intent.Shortcut.GenerateNumber
source: Generate Number
ja: 数字を生成

# Intent.Shortcut.GenerateWord
source: Generate Word
ja: 単語を生成

# Intent.Shortcut.GeneratePassword
source: Generate Password
ja: パスワードを生成

# Intent.Shortcut.SelectEmoji
source: Select Emoji
ja: 絵文字を選択

# Intent.Shortcut.SelectCountry
source: Select Country
ja: 国を選択
